# นับเลข 1-5

'''for i in range(1, 11):
    print(f"รอบที่ : {i}")
'''    
    
'''#นับทีละ 2 (เริ่มที่ 1 ถึง 10 โดยข้ามเลขคู่)
for i in range(1, 11, 2):
    print(f"รอบที่ : {i}")'''
    

'''#นับทีละ 2 (เริ่มที่ 2 ถึง 10 โดยข้ามเลขคี่)
for i in range(2, 11, 2):
    print(f"รอบที่ : {i}")'''
    

'''# นับถอยหลังจาก 10 ถึง 1
for i in range(10, 0, -1):
    print(f"รอบที่ : {i}")'''
    
    
# ตารางสูตรคูณ 18 
for i in range(1, 13):  # เริ่มที่ 1 ถึง 12
    result = 18 * i # คำนวณผลลัพธ์
    print(f"18 x {i} = {result}") 